---
kind: type
id: T:Autodesk.Revit.UI.Plumbing.PipeFittingAndAccessoryPressureDropUIData
source: html/6dcc2335-c5a0-2122-82ed-566efa781f41.htm
---
# Autodesk.Revit.UI.Plumbing.PipeFittingAndAccessoryPressureDropUIData

The input and output data used by external UI servers for storing UI settings.

## Syntax (C#)
```csharp
public class PipeFittingAndAccessoryPressureDropUIData : IDisposable
```